{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "16d61827-c708-448e-b78f-98c07582cd2f",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "pd.options.display.max_columns = 50"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "76f965c3-1bfc-41bb-8ba9-44b7995af75c",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        \n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        \n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        \n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        \n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        \n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "98ff930f-38dc-4a80-a823-0d7395fc98d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record COUNT(n)=281136>]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "uri = 'bolt://107.23.74.224:7687'\n",
    "user = 'neo4j'\n",
    "pwd = 'function-binoculars-twists'\n",
    "\n",
    "conn = Neo4jConnection(uri=uri, user=user, pwd=pwd)\n",
    "conn.query(\"MATCH (n) RETURN COUNT(n)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "b867f3c7-ed36-4aa4-9ebe-ede949273386",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 18.7 s, sys: 596 ms, total: 19.3 s\n",
      "Wall time: 31 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_key</th>\n",
       "      <th>u_id</th>\n",
       "      <th>name</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>is_troll</th>\n",
       "      <th>u_created_at</th>\n",
       "      <th>u_favourites_count</th>\n",
       "      <th>followers_count</th>\n",
       "      <th>statuses_count</th>\n",
       "      <th>lang</th>\n",
       "      <th>location</th>\n",
       "      <th>time_zone</th>\n",
       "      <th>verified</th>\n",
       "      <th>description</th>\n",
       "      <th>t_id</th>\n",
       "      <th>t_created_at</th>\n",
       "      <th>text</th>\n",
       "      <th>t_favorite_count</th>\n",
       "      <th>retweet_count</th>\n",
       "      <th>retweeted</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>764189043152199680</td>\n",
       "      <td>1.471032e+12</td>\n",
       "      <td>Salute brother @iJesseWilliams  https://t.co/7...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>776056376414068738</td>\n",
       "      <td>1.473861e+12</td>\n",
       "      <td>facts https://t.co/OuTm9AdMp3</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>784822121818185728</td>\n",
       "      <td>1.475951e+12</td>\n",
       "      <td>@eddiebellz not \"mutt\" @realDonaldTrump</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>780602260401299456</td>\n",
       "      <td>NaN</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>791056262343655425</td>\n",
       "      <td>1.477437e+12</td>\n",
       "      <td>RT @JohnSmithChgo: @AwooMAGA @kushkandy95 @PWM...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      user_key       u_id              name  screen_name  is_troll  \\\n",
       "0  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "1  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "2  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "3  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "4  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "\n",
       "                     u_created_at  u_favourites_count  followers_count  \\\n",
       "0  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "1  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "2  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "3  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "4  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "\n",
       "   statuses_count lang                       location time_zone verified  \\\n",
       "0         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "1         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "2         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "3         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "4         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "\n",
       "                                         description                t_id  \\\n",
       "0  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  764189043152199680   \n",
       "1  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  776056376414068738   \n",
       "2  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  784822121818185728   \n",
       "3  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  780602260401299456   \n",
       "4  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  791056262343655425   \n",
       "\n",
       "   t_created_at                                               text  \\\n",
       "0  1.471032e+12  Salute brother @iJesseWilliams  https://t.co/7...   \n",
       "1  1.473861e+12                      facts https://t.co/OuTm9AdMp3   \n",
       "2  1.475951e+12            @eddiebellz not \"mutt\" @realDonaldTrump   \n",
       "3           NaN                                                      \n",
       "4  1.477437e+12  RT @JohnSmithChgo: @AwooMAGA @kushkandy95 @PWM...   \n",
       "\n",
       "   t_favorite_count  retweet_count retweeted  \n",
       "0               0.0            0.0     False  \n",
       "1               0.0            0.0     False  \n",
       "2               0.0            0.0     False  \n",
       "3               NaN            NaN      None  \n",
       "4               0.0            0.0     False  "
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"MATCH (u:User)-[:POSTED]->(t:Tweet)\n",
    "           RETURN u.user_key AS user_key,\n",
    "                  u.id AS u_id,\n",
    "                  u.name AS name,\n",
    "                  u.screen_name AS screen_name,\n",
    "                  u.is_troll AS is_troll,\n",
    "                  u.created_at AS u_created_at,\n",
    "                  u.favourites_count AS u_favourites_count,\n",
    "                  u.followers_count AS followers_count,\n",
    "                  u.statuses_count AS statuses_count,\n",
    "                  u.lang AS lang,\n",
    "                  u.location AS location,\n",
    "                  u.time_zone AS time_zone,\n",
    "                  u.verified AS verified,\n",
    "                  u.description AS description,\n",
    "                  t.id AS t_id,\n",
    "                  t.created_at AS t_created_at,\n",
    "                  t.text AS text,\n",
    "                  t.favorite_count AS t_favorite_count,\n",
    "                  t.retweet_count AS retweet_count,\n",
    "                  t.retweeted AS retweeted\n",
    "\"\"\"\n",
    "\n",
    "tweets_df = pd.DataFrame([dict(_) for _ in conn.query(query)])\n",
    "tweets_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "2b766017-c575-4545-9121-26685b1485ba",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(200833, 20)"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tweets_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "324cf78c-8ae3-4fd7-954d-98b5fe05681a",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.19 s, sys: 212 ms, total: 4.4 s\n",
      "Wall time: 10 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t_id</th>\n",
       "      <th>tags</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>836230963667480576</td>\n",
       "      <td>[thingsdonebymistake]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>836227574128861184</td>\n",
       "      <td>[thingsdonebymistake]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>836227673143771136</td>\n",
       "      <td>[thingsdonebymistake]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>836221435249111041</td>\n",
       "      <td>[thingsdonebymistake]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>836228095656919040</td>\n",
       "      <td>[thingsdonebymistake]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 t_id                   tags\n",
       "0  836230963667480576  [thingsdonebymistake]\n",
       "1  836227574128861184  [thingsdonebymistake]\n",
       "2  836227673143771136  [thingsdonebymistake]\n",
       "3  836221435249111041  [thingsdonebymistake]\n",
       "4  836228095656919040  [thingsdonebymistake]"
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"MATCH (t:Tweet)-[:HAS_TAG]->(h:Hashtag)\n",
    "           RETURN t.id AS t_id,\n",
    "                  COLLECT(h.tag) AS tags\n",
    "\"\"\"\n",
    "\n",
    "hashtags_df = pd.DataFrame([dict(_) for _ in conn.query(query)])\n",
    "hashtags_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "a36ea1e0-b056-4131-9267-e17edd852650",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(86719, 2)"
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "hashtags_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "d4d985e3-b2bb-443b-8f90-87760d0929d0",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.45 s, sys: 96.7 ms, total: 2.55 s\n",
      "Wall time: 5.43 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t_id</th>\n",
       "      <th>t.text</th>\n",
       "      <th>user_mentions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>795984497967824897</td>\n",
       "      <td>RT @SCOTTGOHARD: \"you rolling like trump?...ya...</td>\n",
       "      <td>[scottgohard, raekwon]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>766661714104422400</td>\n",
       "      <td>RT @JeffreyKahunas: Mysterious murders are not...</td>\n",
       "      <td>[jeffreykahunas]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>772045505857716224</td>\n",
       "      <td>@JeffreyKahunas Only a blind and dumb fool wou...</td>\n",
       "      <td>[jeffreykahunas]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>774319033470558208</td>\n",
       "      <td>@WesternWindWes #HillaryClinton is an evil!</td>\n",
       "      <td>[westernwindwes]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>765196937960235008</td>\n",
       "      <td>RT @IlikeBIGbuttand: Even #ChildrenThinkThat T...</td>\n",
       "      <td>[ilikebigbuttand]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 t_id                                             t.text  \\\n",
       "0  795984497967824897  RT @SCOTTGOHARD: \"you rolling like trump?...ya...   \n",
       "1  766661714104422400  RT @JeffreyKahunas: Mysterious murders are not...   \n",
       "2  772045505857716224  @JeffreyKahunas Only a blind and dumb fool wou...   \n",
       "3  774319033470558208        @WesternWindWes #HillaryClinton is an evil!   \n",
       "4  765196937960235008  RT @IlikeBIGbuttand: Even #ChildrenThinkThat T...   \n",
       "\n",
       "            user_mentions  \n",
       "0  [scottgohard, raekwon]  \n",
       "1        [jeffreykahunas]  \n",
       "2        [jeffreykahunas]  \n",
       "3        [westernwindwes]  \n",
       "4       [ilikebigbuttand]  "
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"MATCH (t:Tweet)-[:MENTIONS]->(u:User)\n",
    "           RETURN t.id AS t_id,\n",
    "                  t.text,\n",
    "                  COLLECT(u.user_key) AS user_mentions\n",
    "\"\"\"\n",
    "\n",
    "mentions_df = pd.DataFrame([dict(_) for _ in conn.query(query)])\n",
    "mentions_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "c2d76fd9-ff9f-4872-a33e-d242d47627c8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(39514, 3)"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mentions_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "40efbbba-7b40-4ded-8358-5bea26a8caab",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 50.1 ms, sys: 4.13 ms, total: 54.3 ms\n",
      "Wall time: 415 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t_id</th>\n",
       "      <th>reply_to</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>763800602837123072</td>\n",
       "      <td>[763800657719545856]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>759506712516784128</td>\n",
       "      <td>[759506924903751680, 759507042205786112]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>773616523990761472</td>\n",
       "      <td>[773616605259595776]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>759164202611306496</td>\n",
       "      <td>[759165124716429312]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>793874305511780352</td>\n",
       "      <td>[793874529017880577]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 t_id                                  reply_to\n",
       "0  763800602837123072                      [763800657719545856]\n",
       "1  759506712516784128  [759506924903751680, 759507042205786112]\n",
       "2  773616523990761472                      [773616605259595776]\n",
       "3  759164202611306496                      [759165124716429312]\n",
       "4  793874305511780352                      [793874529017880577]"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"MATCH (t1:Tweet)-[:IN_REPLY_TO]->(t2:Tweet)\n",
    "           RETURN t2.id AS t_id,\n",
    "                  COLLECT(t1.id) AS reply_to\n",
    "\"\"\"\n",
    "\n",
    "replies_df = pd.DataFrame([dict(_) for _ in conn.query(query)])\n",
    "replies_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "5a4b1d97-f083-439f-b8f6-3857135fac49",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(516, 2)"
      ]
     },
     "execution_count": 100,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "replies_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "02413bb1-be29-4580-bdbf-64b04a76ca35",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.27 s, sys: 55.8 ms, total: 1.33 s\n",
      "Wall time: 3.12 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t_id</th>\n",
       "      <th>urls</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>777594647875059712</td>\n",
       "      <td>[http://ln.is/twitchy.com/loriz-31/3yafU]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>782408661389840384</td>\n",
       "      <td>[https://twitter.com/i/web/status/782408661389...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>777859822679158784</td>\n",
       "      <td>[http://freedomoutpost.com/2013/02/the-use-of-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>781999544502521857</td>\n",
       "      <td>[http://www.informationliberation.com/?id=55568]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>777238119166775297</td>\n",
       "      <td>[https://twitter.com/Harlan/status/77714580969...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 t_id                                               urls\n",
       "0  777594647875059712          [http://ln.is/twitchy.com/loriz-31/3yafU]\n",
       "1  782408661389840384  [https://twitter.com/i/web/status/782408661389...\n",
       "2  777859822679158784  [http://freedomoutpost.com/2013/02/the-use-of-...\n",
       "3  781999544502521857   [http://www.informationliberation.com/?id=55568]\n",
       "4  777238119166775297  [https://twitter.com/Harlan/status/77714580969..."
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"MATCH (t:Tweet)-[:HAS_LINK]->(u:URL)\n",
    "           WHERE u.expanded_url <> \"\"\n",
    "           RETURN t.id AS t_id,\n",
    "                  COLLECT(u.expanded_url) AS urls\n",
    "\"\"\"\n",
    "\n",
    "url_df = pd.DataFrame([dict(_) for _ in conn.query(query)])\n",
    "url_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "1041c185-25b6-44b2-bc74-d07e0ad918ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(25381, 2)"
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "url_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "id": "d189b18d-9343-47b8-937f-a175b4c6cb10",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.4 s, sys: 120 ms, total: 2.52 s\n",
      "Wall time: 5.49 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t_id</th>\n",
       "      <th>retweet</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>760786317374545920</td>\n",
       "      <td>[760628814871310337]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>784313832487256064</td>\n",
       "      <td>[784310979710492672]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>777594647875059712</td>\n",
       "      <td>[777591478206029824]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>785586729579196416</td>\n",
       "      <td>[785326419509411840]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>795661161282891776</td>\n",
       "      <td>[795463782671798272]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 t_id               retweet\n",
       "0  760786317374545920  [760628814871310337]\n",
       "1  784313832487256064  [784310979710492672]\n",
       "2  777594647875059712  [777591478206029824]\n",
       "3  785586729579196416  [785326419509411840]\n",
       "4  795661161282891776  [795463782671798272]"
      ]
     },
     "execution_count": 119,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"MATCH (t1:Tweet)-[:RETWEETED]->(t2:Tweet)\n",
    "           RETURN t1.id AS t_id,\n",
    "                  COLLECT(t2.id) AS retweet\n",
    "\"\"\"\n",
    "\n",
    "retweets_df = pd.DataFrame([dict(_) for _ in conn.query(query)])\n",
    "retweets_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "id": "ad77f227-0eb0-40f7-9cd9-ae0876b888ae",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_key</th>\n",
       "      <th>u_id</th>\n",
       "      <th>name</th>\n",
       "      <th>screen_name</th>\n",
       "      <th>is_troll</th>\n",
       "      <th>u_created_at</th>\n",
       "      <th>u_favourites_count</th>\n",
       "      <th>followers_count</th>\n",
       "      <th>statuses_count</th>\n",
       "      <th>lang</th>\n",
       "      <th>location</th>\n",
       "      <th>time_zone</th>\n",
       "      <th>verified</th>\n",
       "      <th>description</th>\n",
       "      <th>t_id</th>\n",
       "      <th>t_created_at</th>\n",
       "      <th>text</th>\n",
       "      <th>t_favorite_count</th>\n",
       "      <th>retweet_count</th>\n",
       "      <th>retweeted</th>\n",
       "      <th>t.text</th>\n",
       "      <th>user_mentions</th>\n",
       "      <th>tags</th>\n",
       "      <th>reply_to</th>\n",
       "      <th>urls</th>\n",
       "      <th>retweet</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>764189043152199680</td>\n",
       "      <td>1.471032e+12</td>\n",
       "      <td>Salute brother @iJesseWilliams  https://t.co/7...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "      <td>Salute brother @iJesseWilliams  https://t.co/7...</td>\n",
       "      <td>[ijessewilliams]</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[https://twitter.com/ijessewilliams/status/764...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>776056376414068738</td>\n",
       "      <td>1.473861e+12</td>\n",
       "      <td>facts https://t.co/OuTm9AdMp3</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[https://twitter.com/abc7/status/7759306333861...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>784822121818185728</td>\n",
       "      <td>1.475951e+12</td>\n",
       "      <td>@eddiebellz not \"mutt\" @realDonaldTrump</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "      <td>@eddiebellz not \"mutt\" @realDonaldTrump</td>\n",
       "      <td>[realdonaldtrump]</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>780602260401299456</td>\n",
       "      <td>NaN</td>\n",
       "      <td></td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[780607504128638976]</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>scottgohard</td>\n",
       "      <td>100345056</td>\n",
       "      <td>#Ezekiel2517✨...</td>\n",
       "      <td>SCOTTGOHARD</td>\n",
       "      <td>1</td>\n",
       "      <td>Tue Dec 29 23:15:22 +0000 2009</td>\n",
       "      <td>2774.0</td>\n",
       "      <td>1053.0</td>\n",
       "      <td>31858.0</td>\n",
       "      <td>en</td>\n",
       "      <td>still ⬆️Block⤵️Corner⬇️street</td>\n",
       "      <td></td>\n",
       "      <td>False</td>\n",
       "      <td>CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...</td>\n",
       "      <td>791056262343655425</td>\n",
       "      <td>1.477437e+12</td>\n",
       "      <td>RT @JohnSmithChgo: @AwooMAGA @kushkandy95 @PWM...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>False</td>\n",
       "      <td>RT @JohnSmithChgo: @AwooMAGA @kushkandy95 @PWM...</td>\n",
       "      <td>[jsavite, johnsmithchgo, kushkandy95, awoomaga...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[791055623240708096]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      user_key       u_id              name  screen_name  is_troll  \\\n",
       "0  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "1  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "2  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "3  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "4  scottgohard  100345056  #Ezekiel2517✨...  SCOTTGOHARD         1   \n",
       "\n",
       "                     u_created_at  u_favourites_count  followers_count  \\\n",
       "0  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "1  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "2  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "3  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "4  Tue Dec 29 23:15:22 +0000 2009              2774.0           1053.0   \n",
       "\n",
       "   statuses_count lang                       location time_zone verified  \\\n",
       "0         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "1         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "2         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "3         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "4         31858.0   en  still ⬆️Block⤵️Corner⬇️street              False   \n",
       "\n",
       "                                         description                t_id  \\\n",
       "0  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  764189043152199680   \n",
       "1  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  776056376414068738   \n",
       "2  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  784822121818185728   \n",
       "3  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  780602260401299456   \n",
       "4  CELEBRITY TRAINER ✨#424W147th✨ #CrossfitCoach ...  791056262343655425   \n",
       "\n",
       "   t_created_at                                               text  \\\n",
       "0  1.471032e+12  Salute brother @iJesseWilliams  https://t.co/7...   \n",
       "1  1.473861e+12                      facts https://t.co/OuTm9AdMp3   \n",
       "2  1.475951e+12            @eddiebellz not \"mutt\" @realDonaldTrump   \n",
       "3           NaN                                                      \n",
       "4  1.477437e+12  RT @JohnSmithChgo: @AwooMAGA @kushkandy95 @PWM...   \n",
       "\n",
       "   t_favorite_count  retweet_count retweeted  \\\n",
       "0               0.0            0.0     False   \n",
       "1               0.0            0.0     False   \n",
       "2               0.0            0.0     False   \n",
       "3               NaN            NaN      None   \n",
       "4               0.0            0.0     False   \n",
       "\n",
       "                                              t.text  \\\n",
       "0  Salute brother @iJesseWilliams  https://t.co/7...   \n",
       "1                                                NaN   \n",
       "2            @eddiebellz not \"mutt\" @realDonaldTrump   \n",
       "3                                                NaN   \n",
       "4  RT @JohnSmithChgo: @AwooMAGA @kushkandy95 @PWM...   \n",
       "\n",
       "                                       user_mentions tags  \\\n",
       "0                                   [ijessewilliams]  NaN   \n",
       "1                                                NaN  NaN   \n",
       "2                                  [realdonaldtrump]  NaN   \n",
       "3                                                NaN  NaN   \n",
       "4  [jsavite, johnsmithchgo, kushkandy95, awoomaga...  NaN   \n",
       "\n",
       "               reply_to                                               urls  \\\n",
       "0                   NaN  [https://twitter.com/ijessewilliams/status/764...   \n",
       "1                   NaN  [https://twitter.com/abc7/status/7759306333861...   \n",
       "2                   NaN                                                NaN   \n",
       "3  [780607504128638976]                                                NaN   \n",
       "4                   NaN                                                NaN   \n",
       "\n",
       "                retweet  \n",
       "0                   NaN  \n",
       "1                   NaN  \n",
       "2                   NaN  \n",
       "3                   NaN  \n",
       "4  [791055623240708096]  "
      ]
     },
     "execution_count": 120,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "how = 'left'\n",
    "\n",
    "rtt_df = pd.merge(left=tweets_df, right=mentions_df, how=how, on='t_id', suffixes=('_left','_right'))\n",
    "rtt_df = pd.merge(left=rtt_df, right=hashtags_df, how=how, on='t_id', suffixes=('_left','_right'))\n",
    "rtt_df = pd.merge(left=rtt_df, right=replies_df, how=how, on='t_id', suffixes=('_left','_right'))\n",
    "rtt_df = pd.merge(left=rtt_df, right=url_df, how=how, on='t_id', suffixes=('_left','_right'))\n",
    "rtt_df = pd.merge(left=rtt_df, right=retweets_df, how=how, on='t_id', suffixes=('_left','_right'))\n",
    "rtt_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "id": "f0159fac-86af-4698-96b0-1c88464430d8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(200833, 25)"
      ]
     },
     "execution_count": 116,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rtt_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "78c6b5cc-6f30-4649-8c15-b2fbc5955ade",
   "metadata": {},
   "outputs": [],
   "source": [
    "rtt_df.to_csv('./rtt.csv', header=True, index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9b540662-0601-4bac-b6de-9e039bd4227d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
